Repository: bestdeejay-design/sweet-no-sleep
Catalog: Sources/SweetNoSleep/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, ru, zh_hans

source: When the goal is reached
es: Cuando se alcance el objetivo
ja: 目標に達したとき
ko: 목표에 도달하면
ru: Когда цель достигнута
zh_hans: 达成目标时

source: When this is off, the display may turn off while the Mac stays awake for work. This saves battery.
es: Cuando está desactivado, la pantalla puede apagarse mientras el Mac sigue activo para el trabajo. Así se ahorra batería.
ja: オフにすると、Macは作業のために起きたままでもディスプレイが消えることがあります。バッテリーの節約になります。
ko: 이 옵션을 끄면 Mac은 작업을 위해 깨어 있으면서도 디스플레이는 꺼질 수 있어요. 배터리를 아낄 수 있어요.
ru: Когда выключено, дисплей может гаснуть, пока Mac продолжает работать. Так экономится батарея.
zh_hans: 关闭此项时，Mac 仍会为工作保持唤醒，但显示器可能会关闭。这样可以节省电池。

source: Working
es: Trabajando
ja: 作業中
ko: 작업 중
ru: Работает
zh_hans: 工作中

source: You will be asked to confirm each session. Immediate sleep can interrupt other apps and agents.
es: Se te pedirá confirmar cada sesión. La suspensión inmediata puede interrumpir otras apps y agentes.
ja: セッションごとに確認を求めます。即時スリープは他のアプリやエージェントを中断させることがあります。
ko: 세션마다 확인을 요청해요. 즉시 절전은 다른 앱과 에이전트를 중단시킬 수 있어요.
ru: Каждую сессию придётся подтверждать. Немедленный сон может прервать работу других приложений и агентов.
zh_hans: 每次会话都会要求你确认。立即睡眠可能会中断其他应用和智能体。

source: Your approval is needed (y/n).
es: Se necesita tu aprobación (y/n).
ja: あなたの承認が必要です (y/n)。
ko: 승인이 필요해요 (y/n).
ru: Нужно твоё подтверждение (y/n).
zh_hans: 需要你确认 (y/n)。

source: Your break reminder is ready. It is a suggestion, not a work blocker.
es: Tu recordatorio de pausa está listo. Es una sugerencia, no un obstáculo para el trabajo.
ja: 休憩のリマインダーの準備ができました。これは提案であり、作業を妨げるものではありません。
ko: 휴식 알림이 준비됐어요. 제안일 뿐, 작업을 막지는 않아요.
ru: Напоминание о перерыве готово. Это подсказка, а не препятствие для работы.
zh_hans: 休息提醒已准备好。这只是建议，不会阻碍你的工作。

source: macOS could not keep the display awake (error %d); the system is still protected from idle sleep.
es: macOS no pudo mantener la pantalla activa (error %d); el sistema sigue protegido contra la suspensión por inactividad.
ja: macOSはディスプレイを点灯し続けられませんでした（エラー %d）。システムはアイドル時のスリープからは引き続き保護されています。
ko: macOS가 디스플레이를 켜 둘 수 없었어요(오류 %d). 시스템은 여전히 유휴 절전으로부터 보호되고 있어요.
ru: Не удалось удержать дисплей включённым в macOS (ошибка %d); система всё ещё защищена от сна при простое.
zh_hans: macOS 无法保持显示器常亮（错误 %d）；系统仍受空闲睡眠保护。

source: macOS could not prevent system sleep (error %d).
es: macOS no pudo impedir la suspensión del sistema (error %d).
ja: macOSはシステムのスリープを防止できませんでした（エラー %d）。
ko: macOS가 시스템 절전을 막지 못했어요(오류 %d).
ru: Не удалось предотвратить системный сон в macOS (ошибка %d).
zh_hans: macOS 无法阻止系统睡眠（错误 %d）。

source: macOS is waiting for approval in System Settings > General > Login Items.
es: macOS espera tu aprobación en Ajustes del Sistema > General > Elementos de inicio de sesión.
ja: macOSは、システム設定 > 一般 > ログイン項目で承認を待っています。
ko: macOS가 시스템 설정 > 일반 > 로그인 항목에서 승인을 기다리고 있어요.
ru: macOS ждёт подтверждения в «Настройки системы» > «Основные» > «Объекты входа».
zh_hans: macOS 正在“系统设置 > 通用 > 登录项”中等待批准。

source: macOS rejected the sleep request (error %d).
es: macOS rechazó la solicitud de suspensión (error %d).
ja: macOSがスリープ要求を拒否しました（エラー %d）。
ko: macOS가 절전 요청을 거부했어요(오류 %d).
ru: Запрос на сон отклонён macOS (ошибка %d).
zh_hans: macOS 拒绝了睡眠请求（错误 %d）。

source: none
es: ninguno
ja: なし
ko: 없음
ru: нет
zh_hans: 无

source: focus
es: enfoque
ja: 集中
ko: 집중
ru: фокус
zh_hans: 专注

source: Awake sources
es: Fuentes de actividad
ja: スリープ防止の要因
ko: 깨어 있게 하는 원인
ru: Источники бодрствования
zh_hans: 清醒来源

source: Sweet No Sleep - %@ keep-awake
es: Sweet No Sleep - mantener activo (%@)
ja: Sweet No Sleep - 起動状態の維持（%@）
ko: Sweet No Sleep - 깨어 있기 (%@)
ru: Sweet No Sleep — удержание (%@)
zh_hans: Sweet No Sleep - 保持唤醒（%@）

source: agent × %d
es: agentes × %d
ja: エージェント × %d
ko: 에이전트 × %d
ru: агенты × %d
zh_hans: 智能体 × %d

source: New packs in that folder appear in the picker automatically; Refresh list still works.
es: Los nuevos packs de esa carpeta aparecen automáticamente en el selector; Actualizar lista sigue funcionando.
ja: そのフォルダの新しいパックは自動的にピッカーに表示されます。リストを更新も引き続き使えます。
ko: 그 폴더의 새 팩은 선택기에 자동으로 나타나요. 목록 새로 고침도 그대로 작동해요.
ru: Новые наборы в этой папке автоматически появляются в выборе; «Обновить список» тоже работает.
zh_hans: 该文件夹中的新包会自动出现在选择器中；“刷新列表”仍然可用。

source: %d h %d min
ja: %d時間%d分
ko: %d시간 %d분
ru: %d ч %d мин
zh_hans: %d 小时 %d 分钟

source: %d min
ja: %d分
ko: %d분
ru: %d мин
zh_hans: %d 分钟

source: %d s
ja: %d秒
ko: %d초
ru: %d с
zh_hans: %d 秒

source: 15 min
ja: 15分
ko: 15분
ru: 15 мин
zh_hans: 15 分钟

source: Skin: %@
ja: スキン: %@
ko: 스킨: %@
ru: Скин: %@
zh_hans: 皮肤：%@

source: manual
ja: 手動
ko: 수동
ru: вручную
zh_hans: 手动
